const config = require('../config')
const { cmd, commands } = require('../command');
const os = require("os")
const {runtime} = require('../lib/functions')
const axios = require('axios')

cmd({
    pattern: "menu2",
    alias: "allmenu",
    desc: "menu the bot",
    category: "menu",
    react: "⚡",
    filename: __filename
}, 
async (conn, mek, m, { from, quoted, body, isCmd, command, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply }) => {
    try {
        let dec = `
.    ╭─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🍧⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╮
╭╼☁️⬪࣪ꥈ𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ quєєn nєskσ ໑⃪࣭۪ٜ݊݊݊݊𑁍ꥈ࣪⬪☁️
┃֪࣪  ╰─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🍧⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╯
├ׁ̟̇❍✎ *Oᴡɴᴇʀ:* αчαn mσdz
├ׁ̟̇❍✎ *Mᴏᴅ:* Públic
├ׁ̟̇❍✎ *línguαgє:* Baileys
├ׁ̟̇❍✎ *🄱ᴏᴛ:* Oғᴄ
├ׁ̟̇❍✎ *:Qᴜᴇᴇɴ ɴᴇsᴋᴏ Oғᴄ* 
╚▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬▭╝

*─ׄ─ׄ─⭒─ׄ─ׅ─ׄ⭒─ׄ─ׄ─⭒─ׄ─ׄ─⭒─ׄ─ׅ─*

        *D̸O̸W̸N̸L̸O̸A̸D̸ M̸E̸N̸U̸* 

.    ╭─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🔥⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╮
╭╼☁️⬪࣪ꥈ𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ quєєn nєskσ ໑⃪࣭۪ٜ݊݊݊݊𑁍ꥈ࣪⬪☁️
┃֪࣪  ╰─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🔥⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╯
├ׁ̟̇❍✎ .play _ɴᴀᴍᴇ sᴏɴɢ_
├ׁ̟̇❍✎ .play2 _ɴᴀᴍᴇ sᴏɴɢ_
├ׁ̟̇❍✎ .play3 _ɴᴀᴍᴇ sᴏɴɢ_
├ׁ̟̇❍✎ .play4 _ɴᴀᴍᴇ ᴏʀ ʟɪɴᴋ_
├ׁ̟̇❍✎ .song _ɴᴀᴍᴇ sᴏɴɢ_
├ׁ̟̇❍✎ .song2 _ɴᴀᴍᴇ sᴏɴɢ_
├ׁ̟̇❍✎ .video _ɴᴀᴍᴇ sᴏɴɢ_
├ׁ̟̇❍✎ .video2 _ɴᴀᴍᴇ sᴏɴɢ_
├ׁ̟̇❍✎ .ytmp3 _ʟɪɴᴋ ʏᴏᴜᴛᴜʙᴇ_
├ׁ̟̇❍✎ .ytmp4 _ʟɪɴᴋ ʏᴏᴜᴛᴜɴᴇ_
├ׁ̟̇❍✎ .ytmp3doc _ʟɪɴᴋ ʏᴏᴜᴛᴜɴᴇ_
├ׁ̟̇❍✎ .ytmp4doc _ʟɪɴᴋ ʏᴏᴜᴛᴜɴᴇ_
├ׁ̟̇❍✎ .spotify _ɴᴀᴍᴇ ᴏʀ ʟɪɴᴋ_
├ׁ̟̇❍✎ .facebook _ʟɪɴᴋ_
├ׁ̟̇❍✎ .instagram _ʟɪɴᴋ_
├ׁ̟̇❍✎ .tiktok _ʟɪɴᴋ_
├ׁ̟̇❍✎ .pinterest _ɴᴀᴍᴇ ᴏʀ ʟɪɴᴋ_
├ׁ̟̇❍✎ .twitter _ʟɪɴᴋ_
├ׁ̟̇❍✎ .img _ɴᴀᴍᴇ_
├ׁ̟̇❍✎ .apk _ɴᴀᴍᴇ_
├ׁ̟̇❍✎ .apk2 _ɴᴀᴍᴇ_
├ׁ̟̇❍✎ .mediafire _ʟɪɴᴋ ᴍᴇᴅғɪʀᴇ_
├ׁ̟̇❍✎ .gdrive _ʟɪɴᴋ ᴅɢʀɪᴠᴇ_
├ׁ̟̇❍✎ .movie _ɴᴀᴍᴇ_
├ׁ̟̇❍✎ .darama _ɴᴀᴍᴇ ᴏʀ ʟɪɴᴋ_
├ׁ̟̇❍✎ .audio _ɴᴀᴍᴇ sᴏɴɢ_
├ׁ̟̇❍✎ .audio2 _ɴᴀᴍᴇ sᴏɴɢ_
├ׁ̟̇❍✎ .yts _ɴᴀᴍᴇ_
╚▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬▭╝

*─ׄ─ׄ─⭒─ׄ─ׅ─ׄ⭒─ׄ─ׄ─⭒─ׄ─ׄ─⭒─ׄ─ׅ─*

        *G̸R̸O̸U̸P̸ M̸E̸N̸U̸* 
.    ╭─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🔥⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╮
╭╼☁️⬪࣪ꥈ𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ quєєn nєskσ ໑⃪࣭۪ٜ݊݊݊݊𑁍ꥈ࣪⬪☁️
┃֪࣪  ╰─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🔥⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╯
├ׁ̟̇❍✎ .grouplink _ʟɪɴᴋ ɢʀᴏᴜᴘ_
├ׁ̟̇❍✎ .kickall _ʀᴇᴍᴏᴠᴇ ᴀʟʟ_
├ׁ̟̇❍✎ .kickall2 _ʀᴇᴍᴏᴠᴇ ᴀʟʟ_
├ׁ̟̇❍✎ .kickall3 _ʀᴇᴍᴏᴠᴇ ᴀʟʟ_
├ׁ̟̇❍✎ .add _ᴛᴇxᴛ ɴᴜᴍʙᴇʀ_ 
├ׁ̟̇❍✎ .remove _ʀᴇᴍᴏᴠᴇ ᴍᴇᴍʙᴇʀ_
├ׁ̟̇❍✎ .kick _ʀᴇᴍᴏᴠᴇ ᴍᴇᴍʙᴇʀ_
├ׁ̟̇❍✎ .promote _ᴘʀᴏᴍᴏᴛᴇ ᴀᴅᴍɪɴ_
├ׁ̟̇❍✎ .demote _ᴅᴇᴍᴏᴛᴇ ᴀᴅᴍɪɴ_
├ׁ̟̇❍✎ .dismiss _ᴛᴇxᴛ_
├ׁ̟̇❍✎ .revoke _ʟɪɴᴋ ɢʀᴏᴜᴘ_
├ׁ̟̇❍✎ .setgoodbye _ɴᴇᴡ ᴍᴇssᴀɢᴇ ɢᴏᴏᴅʙʏᴇ_
├ׁ̟̇❍✎ .setwelcome _ɴᴇᴡ ᴍᴇssᴀɢᴇ ᴡᴇʟᴄᴏᴍᴇ_
├ׁ̟̇❍✎ .delete ....
├ׁ̟̇❍✎ .getpic _ᴀᴅᴅ ᴘɪᴄ ɢʀᴏᴜᴘ_
├ׁ̟̇❍✎ .ginfo _ɪɴғᴏʀᴍᴀᴛɪᴏɴ ɢʀᴏᴜᴘ_
├ׁ̟̇❍✎ .disappear on
├ׁ̟̇❍✎ .disappear off
├ׁ̟̇❍✎ .disappear _7D,24H_
├ׁ̟̇❍✎ .updategname _ɴᴇᴡ ɴᴀᴍᴇ ɢʀᴏᴜᴘ_
├ׁ̟̇❍✎ .updategdesc _ɴᴇᴡ ᴅᴇsᴄ ɢʀᴏᴜᴘ_
├ׁ̟̇❍✎ .joinrequests
├ׁ̟̇❍✎ .nikal _ᴏᴡɴᴇʀ_
├ׁ̟̇❍✎ .senddm _ᴏᴡɴᴇʀ_
├ׁ̟̇❍✎ .mute
├ׁ̟̇❍✎ .unmute 
├ׁ̟̇❍✎ .lockgc _ʟᴏᴄᴋ ɢʀᴏᴜᴘ_
├ׁ̟̇❍✎ .unlockgc _ᴜɴʟᴏᴄᴋ ɢʀᴏᴜᴘ_
├ׁ̟̇❍✎ .invite _ʟɪɴᴋ ɢʀᴏᴜᴘ_
├ׁ̟̇❍✎ .tag _ᴍᴇɴᴛɪᴏɴ ᴍᴇᴍʙᴇʀ_
├ׁ̟̇❍✎ .hidetag _ᴛᴇxᴛ_ 
├ׁ̟̇❍✎ .tagadmins _ᴍᴇɴᴛɪᴏɴ ᴀʟʟ_
├ׁ̟̇❍✎ .tagall _ᴍᴇɴᴛɪᴏɴ ᴀʟʟ_
├ׁ̟̇❍✎ .allreq ...
╚▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬▭╝

*─ׄ─ׄ─⭒─ׄ─ׅ─ׄ⭒─ׄ─ׄ─⭒─ׄ─ׄ─⭒─ׄ─ׅ─*

        *O̸W̸N̸E̸R̸ M̸E̸N̸U̸* 
   ╭─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🔥⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╮
╭╼☁️⬪࣪ꥈ𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ quєєn nєskσ ໑⃪࣭۪ٜ݊݊݊݊𑁍ꥈ࣪⬪☁️
┃֪࣪  ╰─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🔥⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╯
├ׁ̟̇❍✎ .owner
├ׁ̟̇❍✎ .ᴍᴇɴᴜ
├ׁ̟̇❍✎ .ʟɪsᴛᴄᴍᴅ
├ׁ̟̇❍✎ .ʙʟᴏᴄᴋ
├ׁ̟̇❍✎ .ᴜɴʙʟᴏᴄᴋ
├ׁ̟̇❍✎ .ғᴜʟʟᴘᴘ
├ׁ̟̇❍✎ .sᴇᴛᴘᴘ
├ׁ̟̇❍✎ .ʀᴇsᴛᴀʀᴛ
├ׁ̟̇❍✎ .sʜᴜᴛᴅᴏᴡɴ
├ׁ̟̇❍✎ .ᴜᴘᴅᴀᴛᴇᴄᴍᴅ
├ׁ̟̇❍✎ .ᴀʟɪᴠᴇ
├ׁ̟̇❍✎ .ɢᴊɪᴅ
├ׁ̟̇❍✎ .ᴊɪᴅ
├ׁ̟̇❍✎ .sᴇᴛʙɪᴏ
╚▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬▭╝

*─ׄ─ׄ─⭒─ׄ─ׅ─ׄ⭒─ׄ─ׄ─⭒─ׄ─ׄ─⭒─ׄ─ׅ─*

        *₵Ø₦VɆⱤ₮ M̸E̸N̸U̸* 
.    ╭─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🔥⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╮
╭╼☁️⬪࣪ꥈ𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ quєєn nєskσ ໑⃪࣭۪ٜ݊݊݊݊𑁍ꥈ࣪⬪☁️
┃֪࣪  ╰─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🔥⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╯
├ׁ̟̇❍✎ .sᴛɪᴄᴋᴇʀ _ᴄᴏɴᴠᴇʀᴛs ɪᴍᴀɢᴇ ᴛᴏ sᴛɪᴄᴋᴇʀ_ 
├ׁ̟̇❍✎ .sᴛɪᴄᴋᴇʀ2 _ᴄᴏɴᴠᴇʀᴛs ɪᴍᴀɢᴇ ᴛᴏ sᴛɪᴄᴋᴇʀ_
├ׁ̟̇❍✎ .ғᴀɴᴄʏ 
├ׁ̟̇❍✎ .ᴛᴀᴋᴇ 
├ׁ̟̇❍✎ .ᴛᴏᴍᴘ3 _ᴄᴏɴᴠᴇʀᴛs ᴠɪᴅᴇᴏ ᴛᴏ ᴀᴜᴅɪᴏ_
├ׁ̟̇❍✎ .ᴛᴛs _ᴄᴏɴᴠᴇʀᴛs ᴡᴏʀᴅs ᴛᴏ ᴀᴜᴅɪᴏ_
├ׁ̟̇❍✎ .ᴛʀᴛ _ᴛʀᴀᴅᴜᴛᴏʀ_
╚▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬▭╝

*─ׄ─ׄ─⭒─ׄ─ׅ─ׄ⭒─ׄ─ׄ─⭒─ׄ─ׄ─⭒─ׄ─ׅ─*

        *₳ł M̸E̸N̸U̸* 
.    ╭─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🔥⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╮
╭╼☁️⬪࣪ꥈ𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ quєєn nєskσ ໑⃪࣭۪ٜ݊݊݊݊𑁍ꥈ࣪⬪☁️
┃֪࣪  ╰─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🔥⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╯
├ׁ̟̇❍✎ .ᴀɪ _ᴛᴇxᴛ_
├ׁ̟̇❍✎ .ɢᴘᴛ _ᴛᴇxᴛ_
├ׁ̟̇❍✎ .ɢᴘᴛ4 _ᴛᴇxᴛ_
├ׁ̟̇❍✎ .ʙʟᴀᴄᴋʙᴏx
├ׁ̟̇❍✎ .ᴍᴇᴛᴀ _ᴛᴇxᴛ_
├ׁ̟̇❍✎ .ʙɪɴɢ _ᴛᴇxᴛ_
├ׁ̟̇❍✎ .ᴄᴏᴘɪʟᴏᴛ _ᴛᴇxᴛ_
╚▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬▭╝

*─ׄ─ׄ─⭒─ׄ─ׅ─ׄ⭒─ׄ─ׄ─⭒─ׄ─ׄ─⭒─ׄ─ׅ─*

        *₣Ʉ₦ M̸E̸N̸U̸* 
   ╭─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🔥⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╮
╭╼☁️⬪࣪ꥈ𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ quєєn nєskσ ໑⃪࣭۪ٜ݊݊݊݊𑁍ꥈ࣪⬪☁️
┃֪࣪  ╰─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🔥⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╯
├ׁ̟̇❍✎ .ɪɴsᴜʟᴛ
├ׁ̟̇❍✎ .ᴊᴏᴋᴇ
├ׁ̟̇❍✎ .ʜᴀᴄᴋ
├ׁ̟̇❍✎ .ʜᴇᴀʀᴛ
├ׁ̟̇❍✎ .ʜᴀᴘᴘʏ
├ׁ̟̇❍✎ .sᴀᴅ
├ׁ̟̇❍✎ .ᴀɴɢʀʏ
├ׁ̟̇❍✎ .sʜʏ
├ׁ̟̇❍✎ .ᴋɪss
├ׁ̟̇❍✎ .ᴍᴏᴏɴ
├ׁ̟̇❍✎ .ᴄᴜɴғᴜᴢᴇᴅ
├ׁ̟̇❍✎ .ʜᴀɴᴅ
├ׁ̟̇❍✎ .ɴɪᴋᴀʟ
╚▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬▭╝

*─ׄ─ׄ─⭒─ׄ─ׅ─ׄ⭒─ׄ─ׄ─⭒─ׄ─ׄ─⭒─ׄ─ׅ─*

        *A̶N̶I̶M̶E̶ M̸E̸N̸U̸* 
   ╭─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🔥⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╮
╭╼☁️⬪࣪ꥈ𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ quєєn nєskσ ໑⃪࣭۪ٜ݊݊݊݊𑁍ꥈ࣪⬪☁️
┃֪࣪  ╰─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🔥⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╯
├ׁ̟̇❍✎ .ᴅᴏɢ
├ׁ̟̇❍✎ .ᴋɪɴɢ
├ׁ̟̇❍✎ .ᴀɴɪᴍᴇɢɪʀʟ
├ׁ̟̇❍✎ .ᴀɴɪᴍᴇɢɪʀʟ1
├ׁ̟̇❍✎ .ᴀɴɪᴍᴇɢɪʀʟ2
├ׁ̟̇❍✎ .ᴀɴɪᴍᴇɢɪʀʟ3
├ׁ̟̇❍✎ .ᴀɴɪᴍᴇɢɪʀʟ4
├ׁ̟̇❍✎ .ᴀɴɪᴍᴇɢɪʀʟ4
├ׁ̟̇❍✎ .ᴀɴɪᴍᴇ1
├ׁ̟̇❍✎ .ᴀɴɪᴍᴇ2
├ׁ̟̇❍✎ .ᴀɴɪᴍᴇ3
├ׁ̟̇❍✎ .ᴀɴɪᴍᴇ4
├ׁ̟̇❍✎ .ᴀɴɪᴍᴇ5
╚▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬▭╝

*─ׄ─ׄ─⭒─ׄ─ׅ─ׄ⭒─ׄ─ׄ─⭒─ׄ─ׄ─⭒─ׄ─ׅ─*

        *Ø₮ⱧɆⱤ M̸E̸N̸U̸* 
   ╭─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🔥⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╮
╭╼☁️⬪࣪ꥈ𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ quєєn nєskσ ໑⃪࣭۪ٜ݊݊݊݊𑁍ꥈ࣪⬪☁️
┃֪࣪  ╰─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🔥⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╯
├ׁ̟̇❍✎ .ғᴀᴄᴛ
├ׁ̟̇❍✎ .ᴄᴘᴘ
├ׁ̟̇❍✎ .ʀᴡ
├ׁ̟̇❍✎ .ᴅᴇғɪɴᴇ 
├ׁ̟̇❍✎ .ɴᴇᴡs
├ׁ̟̇❍✎ .ᴡɪᴋɪᴘᴇᴅɪᴀ
├ׁ̟̇❍✎ .ɢᴘᴀss
├ׁ̟̇❍✎ .ɢɪᴛsᴛᴀʟᴋ
├ׁ̟̇❍✎ .sᴀᴠᴇ
├ׁ̟̇❍✎ .sᴇɴᴅ
├ׁ̟̇❍✎ .ᴀʟɪᴠᴇ
├ׁ̟̇❍✎ .ᴘɪɴɢ
├ׁ̟̇❍✎ .sʏsᴛᴇᴍ
╚▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬ִ▭࣪▬▭╝
> P͎O͎W͎E͎R͎E͎D͎ B͎Y͎ A͎Y͎A͎N͎ M͎O͎D͎Z͎ I͎N͎C͎ 🚩`
await conn.sendMessage(
            from,
            {
                image: { url: `https://i.ibb.co/p6Fn0hQf/temp-image.jpg` },
                caption: dec,
                contextInfo: {
                    mentionedJid: [m.sender],
                    forwardingScore: 999,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363395078593786@newsletter',
                        newsletterName: 'ᴀʏᴀɴ ꜱᴇᴠᴇɴ ᴍᴏᴅᴢ *',
                        serverMessageId: 143
                    }
                }
            },
            { quoted: mek }
        );

    } catch (e) {
        console.log(e);
        reply(`${e}`);
    }
});